Tutorials-Foam-Extend-3.1/movingMesh/forwardStep/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       128384;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       128544;
    }
    bottom
    {
        type            symmetryPlane;
        nFaces          96;
        startFace       128672;
    }
    top
    {
        type            symmetryPlane;
        nFaces          480;
        startFace       128768;
    }
    obstacle
    {
        type            patch;
        nFaces          416;
        startFace       129248;
    }
    defaultFaces
    {
        type            empty;
        nFaces          129024;
        startFace       129664;
    }
)

// ************************************************************************* //
